Lecture4/NACA0012_pimple/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ( 1 0 0);

boundaryField
{

   inlet { type fixedValue; value uniform (1 0 0); }
    top {        type   fixedValue; value uniform (0 0 0); }
    cylinder {   type   fixedValue;  value uniform (0 0 0);}
    bottom    {   type   fixedValue;  value uniform (0 0 0); }
    front    {     type            slip; }
    back    {     type            slip; }
   outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
