Lecture4/NACA0012_pimple/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
 inlet   { type zeroGradient; }
    top {        type   zeroGradient; }
    cylinder { type zeroGradient; }
    bottom    { type zeroGradient; }
    front    { type zeroGradient; }
    back    { type zeroGradient; }
    outlet    { type fixedValue;
    value uniform 0 ;}

}


// ************************************************************************* //
